Messwerte/Archiv/Raw/apache_benchmark_repeat35/default/katafc/httpd/target_count_21/repeat_21/20.txt
2020/01/29 09:12:36 Running: ab -c 100 -t 30 -n 1000000 http://192.168.3.100:8020/
2020/01/29 09:13:06 This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/
Benchmarking 192.168.3.100 (be patient)
Finished 10399 requests
Server Software:        Apache/2.4.41
Server Hostname:        192.168.3.100
Server Port:            8020
Document Path:          /
Document Length:        45 bytes
Concurrency Level:      100
Time taken for tests:   30.000 seconds
Complete requests:      10399
Failed requests:        0
Total transferred:      3005311 bytes
HTML transferred:       467955 bytes
Requests per second:    346.63 [#/sec] (mean)
Time per request:       288.492 [ms] (mean)
Time per request:       2.885 [ms] (mean, across all concurrent requests)
Transfer rate:          97.83 [Kbytes/sec] received
Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    3   9.2      1     132
Processing:     3  286 318.9    101    2558
Waiting:        1  269 289.0     97    2369
Total:          5  288 319.1    102    2561
Percentage of the requests served within a certain time (ms)
  50%    102
  66%    423
  75%    509
  80%    549
  90%    663
  95%    799
  98%   1107
  99%   1461
 100%   2561 (longest request)
2020/01/29 09:13:06 Matched stat line [Connect:        0    3   9.2      1     132 Connect 0 3 9.2 1 132]
2020/01/29 09:13:06 Matched stat line [Processing:     3  286 318.9    101    2558 Processing 3 286 318.9 101 2558]
2020/01/29 09:13:06 Matched stat line [Waiting:        1  269 289.0     97    2369 Waiting 1 269 289.0 97 2369]
2020/01/29 09:13:06 Matched stat line [Total:          5  288 319.1    102    2561 Total 5 288 319.1 102 2561]
2020/01/29 09:13:06 Matched percentline [  50%    102 50 102]
2020/01/29 09:13:06 Matched percentline [  66%    423 66 423]
2020/01/29 09:13:06 Matched percentline [  75%    509 75 509]
2020/01/29 09:13:06 Matched percentline [  80%    549 80 549]
2020/01/29 09:13:06 Matched percentline [  90%    663 90 663]
2020/01/29 09:13:06 Matched percentline [  95%    799 95 799]
2020/01/29 09:13:06 Matched percentline [  98%   1107 98 1107]
2020/01/29 09:13:06 Matched percentline [  99%   1461 99 1461]
2020/01/29 09:13:06 Matched percentline [ 100%   2561 100 2561]
{"connect":{"max":132,"mean":3,"median":1,"min":0,"stdDev":9.199999809265137},"percentiles":{"100":2561,"50":102,"66":423,"75":509,"80":549,"90":663,"95":799,"98":1107,"99":1461},"processing":{"max":2558,"mean":286,"median":101,"min":3,"stdDev":318.8999938964844},"total":{"max":2561,"mean":288,"median":102,"min":5,"stdDev":319.1000061035156},"waiting":{"max":2369,"mean":269,"median":97,"min":1,"stdDev":289}}